zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/misc/renesas/ra-elc/ra6m5-elc.h
#define RA_ELC_EVENT_SCIX1_SCIX1            0x1C1 /**< SCI1 extended serial mode event 1. */
#define RA_ELC_EVENT_SCI2_SCIX1             0x1C1 /**< SCI1 extended serial mode event 1. */
#define RA_ELC_EVENT_SCIX1_SCIX2            0x1C2 /**< SCI1 extended serial mode event 2. */
#define RA_ELC_EVENT_SCI2_SCIX2             0x1C2 /**< SCI1 extended serial mode event 2. */
#define RA_ELC_EVENT_SCIX1_SCIX3            0x1C3 /**< SCI1 extended serial mode event 3. */
#define RA_ELC_EVENT_SCI2_SCIX3             0x1C3 /**< SCI1 extended serial mode event 3. */
#define RA_ELC_EVENT_SPI0_RXI               0x1C4 /**< Receive buffer full. */
#define RA_ELC_EVENT_SPI0_TXI               0x1C5 /**< Transmit buffer empty. */
#define RA_ELC_EVENT_SPI0_IDLE              0x1C6 /**< Idle. */
#define RA_ELC_EVENT_SPI0_ERI               0x1C7 /**< Error. */
#define RA_ELC_EVENT_SPI0_TEI               0x1C8 /**< Transmission complete event. */
#define RA_ELC_EVENT_SPI1_RXI               0x1C9 /**< Receive buffer full. */
#define RA_ELC_EVENT_SPI1_TXI               0x1CA /**< Transmit buffer empty. */
#define RA_ELC_EVENT_SPI1_IDLE              0x1CB /**< Idle. */
#define RA_ELC_EVENT_SPI1_ERI               0x1CC /**< Error. */
#define RA_ELC_EVENT_SPI1_TEI               0x1CD /**< Transmission complete event. */
#define RA_ELC_EVENT_CAN_AFLRAM0_ERI        0x1CE /**< ECC error. */
#define RA_ELC_EVENT_CAN_AFLRAM1_ERI        0x1CF /**< ECC error. */
#define RA_ELC_EVENT_CAN0_MRAM_ERI          0x1D0 /**< CANFD0 ECC error. */
#define RA_ELC_EVENT_OSPI_INT               0x1D9 /**< OSPI interrupt. */
#define RA_ELC_EVENT_QSPI_INT               0x1DA /**< QSPI interrupt. */
#define RA_ELC_EVENT_DOC_INT                0x1DB /**< Data operation circuit interrupt. */

/* Renesas RA ELC peripherals that can be linked to event signals. */
#define RA_ELC_PERIPHERAL_GPT_A   0  /**< General PWM Timer A */
#define RA_ELC_PERIPHERAL_GPT_B   1  /**< General PWM Timer B */
#define RA_ELC_PERIPHERAL_GPT_C   2  /**< General PWM Timer C */
#define RA_ELC_PERIPHERAL_GPT_D   3  /**< General PWM Timer D */
#define RA_ELC_PERIPHERAL_GPT_E   4  /**< General PWM Timer E */
#define RA_ELC_PERIPHERAL_GPT_F   5  /**< General PWM Timer F */
#define RA_ELC_PERIPHERAL_GPT_G   6  /**< General PWM Timer G */
#define RA_ELC_PERIPHERAL_GPT_H   7  /**< General PWM Timer H */
#define RA_ELC_PERIPHERAL_ADC0    8  /**< ADC0 */
#define RA_ELC_PERIPHERAL_ADC0_B  9  /**< ADC0 Group B */
#define RA_ELC_PERIPHERAL_ADC1    10 /**< ADC1 */
#define RA_ELC_PERIPHERAL_ADC1_B  11 /**< ADC1 Group B */
#define RA_ELC_PERIPHERAL_DAC0    12 /**< DAC0 */
#define RA_ELC_PERIPHERAL_DAC1    13 /**< DAC1 */
#define RA_ELC_PERIPHERAL_IOPORT1 14 /**< IOPORT1 */
#define RA_ELC_PERIPHERAL_IOPORT2 15 /**< IOPORT2 */
#define RA_ELC_PERIPHERAL_IOPORT3 16 /**< IOPORT3 */
#define RA_ELC_PERIPHERAL_IOPORT4 17 /**< IOPORT4 */
#define RA_ELC_PERIPHERAL_CTSU    18 /**< CTSU */

/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_MISC_RENESAS_RA_ELC_RA6M5_ELC_H_ */
